n, m=map(int, input().split())
a=[]
for i in range(n):
    a.append(list(map(int, input().split())))

tetris = [[(0,1), (0,2), (0,3)], [(1,0), (2,0), (3,0)], #I미노
        [(0,1), (1,0), (1,1)], #O미노
        [(1,0),(1,1),(2,1)], [(0,-1), (1,-1), (1,-2)], #Z미노
        [(1,0), (1,-1), (2,-1)],[(0,1), (1,1), (1,2)], #S미노
        [(1,0), (2,0), (2,1)], [(0,1), (0,2), (1,0)], #L미노
        [(0,1),(1,1), (2,1)], [(0,1), (0,2), (-1,2)],
        [(1,0),(2,0),(2,-1)],[(0,1),(0,2),(1,2)], 
        [(1,0),(2,0),(0,1)], [(1,0),(1,1),(1,2)], #J미노
        [(1,0),(1,1),(1,-1)], [(1,0),(1,1),(2,0)], #T미노
        [(0,-1),(1,0),(0,1)],[(0,1),(-1,1),(1,1)]
]

def calc(i,j,tet) :
    temp = a[i][j] # 시작 위치는 범위 내 유효한 값
    for di,dj in tet :
        # 나머지 위치에 대해서는 범위 내 유효한지 검사
        ni, nj = i + di, j + dj
        if 0<=ni<n and 0<=nj<m:
            temp += a[ni][nj]
        else :
            return 0
    return temp


ans = 0
for i in range (n) :
    for j in range (m) :
        for tet in tetris:
            temp = calc(i,j,tet)
            ans = max(temp, ans)

print(ans)